nxp-mcuxpresso/mcux-sdk-examples/rdrw612bga/driver_examples/usart/hardware_flow_control/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.16.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: F10, peripheral: FLEXCOMM0, signal: USART_RXD, pin_signal: GPIO_2}
  - {pin_num: C13, peripheral: FLEXCOMM0, signal: USART_TXD, pin_signal: GPIO_3}
  - {pin_num: M1, peripheral: FLEXCOMM0, signal: USART_CTS, pin_signal: GPIO_0}
  - {pin_num: L7, peripheral: FLEXCOMM0, signal: USART_RTS, pin_signal: GPIO_5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC0_USART_DATA functionality on pin GPIO_2, GPIO_3 (pin F10_C13) */
    IO_MUX_SetPinMux(IO_MUX_FC0_USART_DATA);
    /* Initialize FC0_USART_CMD functionality on pin GPIO_0, GPIO_5 (pin M1_L7) */
    IO_MUX_SetPinMux(IO_MUX_FC0_USART_CMD);
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin E5) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
